# 4. Data Analysis

In [1]:
import pandas as pd
df = pd.read_csv('info.csv')
df

,Number,Name,Height,Weight,School,Gender,Python,Java,Javascript,C#,C++,HTML
0,No.1,Tom,175,80,MIT,M,80,75,77,97,92,72
1,No.2,Noah,190,90,MIT,M,90,92,95,87,80,93
2,No.3,Lucas,185,83,Harvard,M,30,25,15,23,13,50
3,No.4,Mia,165,50,MIT,F,66,54,59,61,54,54
4,No.5,Amelia,170,56,Harvard,F,72,77,62,74,72,69
5,No.6,Sophia,160,60,MIT,F,93,95,90,88,85,82
6,No.7,James,183,72,Harvard,M,100,97,100,95,91,99
7,No.8,Ava,172,55,MIT,F,76,73,70,66,68,73

In [2]:
df = pd.read_csv('info.csv', index_col='Number') # Number을 인덱스로 설정하여 불러옴
df

,Name,Height,Weight,School,Gender,Python,Java,Javascript,C#,C++,HTML
Number,,,,,,,,,,,
No.1,Tom,175,80,MIT,M,80,75,77,97,92,72
No.2,Noah,190,90,MIT,M,90,92,95,87,80,93
No.3,Lucas,185,83,Harvard,M,30,25,15,23,13,50
No.4,Mia,165,50,MIT,F,66,54,59,61,54,54
No.5,Amelia,170,56,Harvard,F,72,77,62,74,72,69
No.6,Sophia,160,60,MIT,F,93,95,90,88,85,82
No.7,James,183,72,Harvard,M,100,97,100,95,91,99
No.8,Ava,172,55,MIT,F,76,73,70,66,68,73

In [3]:
type(df) # DataFrame Object 확인

pandas.core.frame.DataFrame

In [4]:
df.info() # 데이터 정보를 확인

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, No.1 to No.8
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Height      8 non-null      int64
 2   Weight      8 non-null      int64
 3   School      8 non-null      object
 4   Gender      8 non-null      object
 5   Python      8 non-null      int64
 6   Java        8 non-null      int64
 7   Javascript  8 non-null      int64
 8   C#          8 non-null      int64
 9   C++         8 non-null      int64
 10  HTML        8 non-null      int64
dtypes: int64(8), object(3)
memory usage: 768.0+ bytes

In [5]:
df.index # index 확인

Index(['No.1', 'No.2', 'No.3', 'No.4', 'No.5', 'No.6', 'No.7', 'No.8'], dtype='object', name='Number')

In [6]:
df.columns # columns 확인

Index(['Name', 'Height', 'Weight', 'School', 'Gender', 'Python', 'Java',
       'Javascript', 'C#', 'C++', 'HTML'],
      dtype='object')

In [7]:
df.dtypes # 데이터 타입 확인

Name          object
Height         int64
Weight         int64
School        object
Gender        object
Python         int64
Java           int64
Javascript     int64
C#             int64
C++            int64
HTML           int64
dtype: object

In [8]:
df.shape # (row, column) 확인

(8, 11)

In [9]:
df.values # 데이터 값 확인

array([['Tom', 175, 80, 'MIT', 'M', 80, 75, 77, 97, 92, 72],
       ['Noah', 190, 90, 'MIT', 'M', 90, 92, 95, 87, 80, 93],
       ['Lucas', 185, 83, 'Harvard', 'M', 30, 25, 15, 23, 13, 50],
       ['Mia', 165, 50, 'MIT', 'F', 66, 54, 59, 61, 54, 54],
       ['Amelia', 170, 56, 'Harvard', 'F', 72, 77, 62, 74, 72, 69],
       ['Sophia', 160, 60, 'MIT', 'F', 93, 95, 90, 88, 85, 82],
       ['James', 183, 72, 'Harvard', 'M', 100, 97, 100, 95, 91, 99],
       ['Ava', 172, 55, 'MIT', 'F', 76, 73, 70, 66, 68, 73]], dtype=object)

In [10]:
df.describe() # Hashable 데이터의 통계치 확인

,Height,Weight,Python,Java,Javascript,C#,C++,HTML
count,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000
mean,175.000000,68.250000,75.875000,73.500000,71.000000,73.875000,69.375000,74.000000
std,10.337173,14.973787,21.741583,24.213338,27.192436,24.403966,26.076467,17.138095
min,160.000000,50.000000,30.000000,25.000000,15.000000,23.000000,13.000000,50.000000
25%,168.750000,55.750000,70.500000,68.250000,61.250000,64.750000,64.500000,65.250000
50%,173.500000,66.000000,78.000000,76.000000,73.500000,80.500000,76.000000,72.500000
75%,183.500000,80.750000,90.750000,92.750000,91.250000,89.750000,86.500000,84.750000
max,190.000000,90.000000,100.000000,97.000000,100.000000,97.000000,92.000000,99.000000

In [11]:
df.head() # 첫 5개의 데이터 확인

,Name,Height,Weight,School,Gender,Python,Java,Javascript,C#,C++,HTML
Number,,,,,,,,,,,
No.1,Tom,175,80,MIT,M,80,75,77,97,92,72
No.2,Noah,190,90,MIT,M,90,92,95,87,80,93
No.3,Lucas,185,83,Harvard,M,30,25,15,23,13,50
No.4,Mia,165,50,MIT,F,66,54,59,61,54,54
No.5,Amelia,170,56,Harvard,F,72,77,62,74,72,69

In [12]:
df.tail() # 끝 5개의 데이터 확인

,Name,Height,Weight,School,Gender,Python,Java,Javascript,C#,C++,HTML
Number,,,,,,,,,,,
No.4,Mia,165,50,MIT,F,66,54,59,61,54,54
No.5,Amelia,170,56,Harvard,F,72,77,62,74,72,69
No.6,Sophia,160,60,MIT,F,93,95,90,88,85,82
No.7,James,183,72,Harvard,M,100,97,100,95,91,99
No.8,Ava,172,55,MIT,F,76,73,70,66,68,73

## 특정 column(Series)의 통계치 확인

In [13]:
df['Python'].describe() # 통계치 확인

count      8.000000
mean      75.875000
std       21.741583
min       30.000000
25%       70.500000
50%       78.000000
75%       90.750000
max      100.000000
Name: Python, dtype: float64

In [14]:
df['Python'].max() # 최댓값

100

In [15]:
df['Python'].min() # 최솟값

30

In [16]:
df['Python'].nlargest(3) # 가장 Python 점수가 높은 3명 확인

Number
No.7    100
No.6     93
No.2     90
Name: Python, dtype: int64

In [17]:
df['Python'].mean() # 평균

75.875

In [18]:
df['Python'].count() # NaN이 아닌 데이터 확인

8

In [19]:
df['School'].unique() # unique한 데이터 확인

array(['MIT', 'Harvard'], dtype=object)